grevaillot/svd_tools/headers/STM32F030/memorymap.h
#pragma once 

#define TIM3_BASE			(0x40000400)
#define TIM6_BASE			(0x40001000)
#define TIM14_BASE			(0x40002000)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define USART2_BASE			(0x40004400)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define PWR_BASE			(0x40007000)
#define SYSCFG_BASE			(0x40010000)
#define EXTI_BASE			(0x40010400)
#define ADC_BASE			(0x40012400)
#define TIM1_BASE			(0x40012c00)
#define SPI1_BASE			(0x40013000)
#define USART1_BASE			(0x40013800)
#define TIM15_BASE			(0x40014000)
#define TIM16_BASE			(0x40014400)
#define TIM17_BASE			(0x40014800)
#define DBGMCU_BASE			(0x40015800)
#define DMA_BASE			(0x40020000)
#define RCC_BASE			(0x40021000)
#define Flash_BASE			(0x40022000)
#define CRC_BASE			(0x40023000)
#define GPIOA_BASE			(0x48000000)
#define GPIOB_BASE			(0x48000400)
#define GPIOC_BASE			(0x48000800)
#define GPIOD_BASE			(0x48000c00)
#define GPIOF_BASE			(0x48001400)
#define NVIC_BASE			(0xe000e100)
